app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'harshalkutkar@yahoo.com' LIMIT 1
---
  def login
         @user = User.new
          #Check credentials here
          @user.email = params[:user][:email]
          @user.password = params[:user][:password]

        @user = User.find_by_email(@user.email)

SELECT "users".* FROM "users" WHERE "users"."email" = 'harshalkutkar@yahoo.com' LIMIT 1
---
 def authenticate


   @user = User.new
   #Check credentials here
   @user.email = params[:user][:email]
   @user.password = params[:user][:password]

   @user = User.find_by_email(@user.email)