app/controllers/photos_controller.rb

  def uploads
    @user = params[:uid]
    @photos = Photo.where(:uid=>@user)
---
SELECT "photos".* FROM "photos" WHERE "photos"."uid" IS NULL

    #------

    respond_to do |format|
      if @photo.save
---
INSERT INTO "photos" ("caption", "created_at", "name", "tags", "updated_at") VALUES (?, ?, ?, ?, ?)  [["caption", "Cats"], ["created_at", Sun, 08 Sep 2013 19:48:02 UTC +00:00], ["name", "pic_2013090815480298.jpg"], ["tags", "#cat #funny #mac"], ["updated_at", Sun, 08 Sep 2013 19:48:02 UTC +00:00]]

  def update
    respond_to do |format|
      if @photo.update(photo_params)
---
UPDATE "photos" SET "uid" = ?, "updated_at" = ? WHERE "photos"."id" = 3  [["uid", 10], ["updated_at", Sun, 08 Sep 2013 19:48:08 UTC +00:00]]

    def set_photo
      if params[:id]== ("uploads")
        redirect_to :controller => 'photos',:action => 'uploads'
      end
      @photo = Photo.find(params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "3"]]