app/controllers/users_controller.rb

INSERT INTO "users" ("about", "address", "background_pic", "city", "country", "created_at", "email", "encrypted_password", "first_name", "last_name", "profile_pic", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---

    Rails.logger.debug("debug: Create Called")
    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
SELECT COUNT(*) FROM "users" WHERE "users"."id" IS NULL
SELECT "users".* FROM "users" WHERE "users"."username" = 'harshalkutkar' LIMIT 1
---
    def set_user
      if !(User.where(id: params[:id]).empty?)
      @user = User.find(params[:id])
      else
      @user = User.find_by_username(params[:username])